import Engineer from "../assets/engineer.svg";
import CS from "../assets/computer scince.svg";

// Data Of The Website 

export const NAV_ITEM = [
  { title: "عن الكلية", link: "#main" },
  { title: "رسالتنا", link: "#OurMessage" },
  { title: "أهدافنا", link: "#OurTarget" },
  { title: "الأقسام العلمية", link: "#dept" },
  { title: "تواصل معنا", link: "#contactUs" },
];

export const DETALIS_DEPT = [
  {
    img: `${Engineer}`,
    id: 1,
    dept: "هندسة البرمجيات",
    desc: " هندسة البرمجيات هو تخصص يركز على تطبيق المبادئ الهندسية وأفضل الممارسات لضمان إنتاج برامج عالية الجودة وموثوقة وقابلة للصيانة.لا يشمل فقط عملية التطوير ولكن أيضا جوانب مثل إدارة المشاريع وتحليل النظام وصيانة البرامج.",
    detalis: [
      {
        title: "Skills",
        id: "skills",
        content: (
          <ul className="list-disc pr-2 ">
            <li>إعداد كوادر متخصصة في البرمجة تلبي احتياجات السوق الليبي.</li>
            <li>
              مواكبة التطورات في تكنولوجيا المعلومات وتزويد الطلاب بأحدث
              التقنيات.
            </li>
            <li>
              خدمة المجتمع الليبي من خلال توفير حلول برمجية وتطوير برامج تخدم
              احتياجاته.
            </li>
            <li>تنمية مهارات التفكير النقدي والإبداع لدى الطلاب.</li>
          </ul>
        ),
      },
      {
        title: "Education",
        id: "Education",
        content: (
          <ul className=" pr-2">
            <li>
              يحق للطالب الالتحاق بقسم هندسة البرمجيات إدا أنجز (65) وحدة دراسيه
              متضمنة مادة (مقدمة في هندسة البرمجيات ) وبمعدل لايقل عن 60%
            </li>
          </ul>
        ),
      },
    ],
  },
  {
    img: `${CS}`,
    id: 2,
    dept: "علوم الحاسوب",
    desc: "يهتم تخصص علوم الحاسوب ببناء المعرفة المتخصصة للطالب في مجال الحاسوب، وذلك لإعداده للعمل في مجالات البرمجة وشبكات الحاسوب، وتطوير أنظمة الحاسوب الآلية المختلفة في مختلف المؤسسات الرسمية، فضلا عن القطاع الخاص و المؤسسات والشركات، و يتعلم الطالب أيضًا الدورات التي تبني معرفته بالبرمجة، و يدرس عددًا من لغات البرمجة المتقدمة، وأسس تصميم الخوارزميات وتحليلها، وهياكل البيانات، والبرمجة المرئية والكائنات، وأنظمة قواعد البيانات، كما يتعرف على أحدث طرق تحليل الأنظمة وتصميمها باستخدام أحدث الأنظمة المستخدمة لهذا الغرض .",
    detalis: [
      {
        title: "Skills",
        id: "skills",
        content: (
          <ul className="list-disc pr-2 ">
            <li>تخريج كوادر متخصصة في علوم الحاسوب.</li>
            <li>مواكبة التطورات في مجال تكنولوجيا المعلومات.</li>
            <li>تنمية مهارات التفكير النقدي والإبداع لدى الطلاب.</li>
            <li>المساهمة في تطوير المعرفة في مجال علوم الحاسوب.</li>
            <li>نشر الوعي بأهمية علوم الحاسوب وتأثيرها على المجتمع.</li>
            <li>خدمة المجتمع من خلال تقديم الاستشارات ونشر الوعي.</li>
          </ul>
        ),
      },
      {
        title: "Education",
        id: "Education",
        content: (
          <ul className="pr-2">
            <li>
              يحق للطالب الالتحاق بقسم علوم الحاسوب إدا أنجز (65) وحدة دراسيه
              متضمنة مادة (تقنيات حل المشكلة) وبمعدل لايقل عن 60%
            </li>
          </ul>
        ),
      },
    ],
  },
];
